CREATE INDEX IX_Цінний_актив_Тип ON [BrokerDB].[dbo].[Цінний_актив] ([Тип])
EXEC sp_helpindex Цінний_актив
GO



SET SHOWPLAN_ALL ON;
GO

SELECT * FROM [Цінний_актив]
LEFT JOIN Договір 
ON Цінний_актив.Код_активу = Договір.Код_активу
LEFT JOIN Продавець
ON Продавець.Код_продавця = Договір.Код_продавця
LEFT JOIN Брокерська_компанія 
ON Договір.Код_компанії = Брокерська_компанія.Код_компанії
WHERE Цінний_актив.Код_активу LIKE 'S%' OR Цінний_актив.Код_активу LIKE 'M'
ORDER BY Цінний_актив.Ціна DESC
