CREATE VIEW Doc_Assets_Seller_View
AS SELECT Договір.Код_договору AS Код_договору,
Цінний_актив.Код_активу AS Код_активу,
Цінний_актив.Назва AS Назва,
Цінний_актив.Тип AS Тип,
Цінний_актив.Ціна AS Ціна,
Продавець.Імя AS Імя,
Продавець.Прізвише AS Прізвише,
Продавець.Номер_телефону AS Номер_телефону

FROM Договір INNER JOIN Цінний_актив ON Договір.Код_активу = Цінний_актив.Код_активу
INNER JOIN Продавець ON Договір.Код_продавця = Продавець.Код_продавця

SELECT * FROM [BrokerDB].[dbo].[Doc_Assets_Seller_View]
where [Ціна] > 50000

Select Договір.*, Цінний_актив.* FROM Договір, Цінний_актив
WHERE Договір.Код_активу = Цінний_актив.Код_активу

Select Договір.*, Цінний_актив.* FROM Договір, Цінний_актив
WHERE Договір.Код_активу = Цінний_актив.Код_активу
AND Цінний_актив.Ціна < 50000

