SELECT Продавець.Код_продавця, COUNT(Цінний_актив.Код_активу) FROM Продавець 
LEFT JOIN Договір
ON Продавець.Код_продавця = Договір.Код_продавця
LEFT JOIN Цінний_актив 
ON Договір.Код_активу = Цінний_актив.Код_активу
GROUP BY Продавець.Код_продавця


SELECT Тип, AVG(Ціна) FROM [dbo].[Цінний_актив]
GROUP BY Тип


SELECT Продавець.Код_продавця, AVG(Цінний_актив.Ціна) FROM Продавець 
LEFT JOIN Договір
ON Продавець.Код_продавця = Договір.Код_продавця
LEFT JOIN Цінний_актив 
ON Договір.Код_активу = Цінний_актив.Код_активу
GROUP BY Продавець.Код_продавця
